grevaillot/svd_tools/headers/STM32H750x/adc2.h
#pragma once 

/* --- ADC2: Analog to Digital Converter ---------------------------- */

/** @defgroup adc2_registers Analog to Digital Converter Register
@{*/

/** ADC2_ISR ADC interrupt and status register **/
#define ADC2_ISR			MMIO32(ADC2_BASE + 0x00)
/** ADC2_IER ADC interrupt enable register **/
#define ADC2_IER			MMIO32(ADC2_BASE + 0x04)
/** ADC2_CR ADC control register **/
#define ADC2_CR			MMIO32(ADC2_BASE + 0x08)
/** ADC2_CCR ADC common control register **/
#define ADC2_CCR			MMIO32(ADC2_BASE + 0x08)
/** ADC2_CFGR ADC configuration register 1 **/
#define ADC2_CFGR			MMIO32(ADC2_BASE + 0x0c)
/** ADC2_CFGR2 ADC configuration register 2 **/
#define ADC2_CFGR2			MMIO32(ADC2_BASE + 0x10)
/** ADC2_SMPR1 ADC sampling time register 1 **/
#define ADC2_SMPR1			MMIO32(ADC2_BASE + 0x14)
/** ADC2_SMPR2 ADC sampling time register 2 **/
#define ADC2_SMPR2			MMIO32(ADC2_BASE + 0x18)
/** ADC2_PCSEL ADC pre channel selection register **/
#define ADC2_PCSEL			MMIO32(ADC2_BASE + 0x1c)
/** ADC2_LTR1 ADC analog watchdog 1 threshold register **/
#define ADC2_LTR1			MMIO32(ADC2_BASE + 0x20)
/** ADC2_LHTR1 ADC analog watchdog 2 threshold register **/
#define ADC2_LHTR1			MMIO32(ADC2_BASE + 0x24)
/** ADC2_SQR1 ADC group regular sequencer ranks register 1 **/
#define ADC2_SQR1			MMIO32(ADC2_BASE + 0x30)
/** ADC2_SQR2 ADC group regular sequencer ranks register 2 **/
#define ADC2_SQR2			MMIO32(ADC2_BASE + 0x34)
/** ADC2_SQR3 ADC group regular sequencer ranks register 3 **/
#define ADC2_SQR3			MMIO32(ADC2_BASE + 0x38)
/** ADC2_SQR4 ADC group regular sequencer ranks register 4 **/
#define ADC2_SQR4			MMIO32(ADC2_BASE + 0x3c)
/** ADC2_DR ADC group regular conversion data register **/
#define ADC2_DR			MMIO32(ADC2_BASE + 0x40)
/** ADC2_JSQR ADC group injected sequencer register **/
#define ADC2_JSQR			MMIO32(ADC2_BASE + 0x4c)
/** ADC2_OFR1 ADC offset number 1 register **/
#define ADC2_OFR1			MMIO32(ADC2_BASE + 0x60)
/** ADC2_OFR2 ADC offset number 2 register **/
#define ADC2_OFR2			MMIO32(ADC2_BASE + 0x64)
/** ADC2_OFR3 ADC offset number 3 register **/
#define ADC2_OFR3			MMIO32(ADC2_BASE + 0x68)
/** ADC2_OFR4 ADC offset number 4 register **/
#define ADC2_OFR4			MMIO32(ADC2_BASE + 0x6c)
/** ADC2_JDR1 ADC group injected sequencer rank 1 register **/
#define ADC2_JDR1			MMIO32(ADC2_BASE + 0x80)
/** ADC2_JDR2 ADC group injected sequencer rank 2 register **/
#define ADC2_JDR2			MMIO32(ADC2_BASE + 0x84)
/** ADC2_JDR3 ADC group injected sequencer rank 3 register **/
#define ADC2_JDR3			MMIO32(ADC2_BASE + 0x88)
/** ADC2_JDR4 ADC group injected sequencer rank 4 register **/
#define ADC2_JDR4			MMIO32(ADC2_BASE + 0x8c)
/** ADC2_AWD2CR ADC analog watchdog 2 configuration register **/
#define ADC2_AWD2CR			MMIO32(ADC2_BASE + 0xa0)
/** ADC2_AWD3CR ADC analog watchdog 3 configuration register **/
#define ADC2_AWD3CR			MMIO32(ADC2_BASE + 0xa4)
/** ADC2_LTR2 ADC watchdog lower threshold register 2 **/
#define ADC2_LTR2			MMIO32(ADC2_BASE + 0xb0)
/** ADC2_HTR2 ADC watchdog higher threshold register 2 **/
#define ADC2_HTR2			MMIO32(ADC2_BASE + 0xb4)
/** ADC2_LTR3 ADC watchdog lower threshold register 3 **/
#define ADC2_LTR3			MMIO32(ADC2_BASE + 0xb8)
/** ADC2_HTR3 ADC watchdog higher threshold register 3 **/
#define ADC2_HTR3			MMIO32(ADC2_BASE + 0xbc)
/** ADC2_DIFSEL ADC channel differential or single-ended mode selection register **/
#define ADC2_DIFSEL			MMIO32(ADC2_BASE + 0xc0)
/** ADC2_CALFACT ADC calibration factors register **/
#define ADC2_CALFACT			MMIO32(ADC2_BASE + 0xc4)
/** ADC2_CALFACT2 ADC Calibration Factor register 2 **/
#define ADC2_CALFACT2			MMIO32(ADC2_BASE + 0xc8)

/**@}*/


/** @defgroup adc2_isr ISR ADC interrupt and status register
@{*/

/** ADC2_ISR_JQOVF ADC group injected contexts queue overflow flag **/
#define ADC2_ISR_JQOVF		(1 << 10)
/** ADC2_ISR_AWD3 ADC analog watchdog 3 flag **/
#define ADC2_ISR_AWD3		(1 << 9)
/** ADC2_ISR_AWD2 ADC analog watchdog 2 flag **/
#define ADC2_ISR_AWD2		(1 << 8)
/** ADC2_ISR_AWD1 ADC analog watchdog 1 flag **/
#define ADC2_ISR_AWD1		(1 << 7)
/** ADC2_ISR_JEOS ADC group injected end of sequence conversions flag **/
#define ADC2_ISR_JEOS		(1 << 6)
/** ADC2_ISR_JEOC ADC group injected end of unitary conversion flag **/
#define ADC2_ISR_JEOC		(1 << 5)
/** ADC2_ISR_OVR ADC group regular overrun flag **/
#define ADC2_ISR_OVR		(1 << 4)
/** ADC2_ISR_EOS ADC group regular end of sequence conversions flag **/
#define ADC2_ISR_EOS		(1 << 3)
/** ADC2_ISR_EOC ADC group regular end of unitary conversion flag **/
#define ADC2_ISR_EOC		(1 << 2)
/** ADC2_ISR_EOSMP ADC group regular end of sampling flag **/
#define ADC2_ISR_EOSMP		(1 << 1)
/** ADC2_ISR_ADRDY ADC ready flag **/
#define ADC2_ISR_ADRDY		(1 << 0)

/**@}*/

/** @defgroup adc2_ier IER ADC interrupt enable register
@{*/

/** ADC2_IER_JQOVFIE ADC group injected contexts queue overflow interrupt **/
#define ADC2_IER_JQOVFIE		(1 << 10)
/** ADC2_IER_AWD3IE ADC analog watchdog 3 interrupt **/
#define ADC2_IER_AWD3IE		(1 << 9)
/** ADC2_IER_AWD2IE ADC analog watchdog 2 interrupt **/
#define ADC2_IER_AWD2IE		(1 << 8)
/** ADC2_IER_AWD1IE ADC analog watchdog 1 interrupt **/
#define ADC2_IER_AWD1IE		(1 << 7)
/** ADC2_IER_JEOSIE ADC group injected end of sequence conversions interrupt **/
#define ADC2_IER_JEOSIE		(1 << 6)
/** ADC2_IER_JEOCIE ADC group injected end of unitary conversion interrupt **/
#define ADC2_IER_JEOCIE		(1 << 5)
/** ADC2_IER_OVRIE ADC group regular overrun interrupt **/
#define ADC2_IER_OVRIE		(1 << 4)
/** ADC2_IER_EOSIE ADC group regular end of sequence conversions interrupt **/
#define ADC2_IER_EOSIE		(1 << 3)
/** ADC2_IER_EOCIE ADC group regular end of unitary conversion interrupt **/
#define ADC2_IER_EOCIE		(1 << 2)
/** ADC2_IER_EOSMPIE ADC group regular end of sampling interrupt **/
#define ADC2_IER_EOSMPIE		(1 << 1)
/** ADC2_IER_ADRDYIE ADC ready interrupt **/
#define ADC2_IER_ADRDYIE		(1 << 0)

/**@}*/

/** @defgroup adc2_cr CR ADC control register
@{*/

/** ADC2_CR_ADCAL ADC calibration **/
#define ADC2_CR_ADCAL		(1 << 31)
/** ADC2_CR_ADCALDIF ADC differential mode for calibration **/
#define ADC2_CR_ADCALDIF		(1 << 30)
/** ADC2_CR_DEEPPWD ADC deep power down enable **/
#define ADC2_CR_DEEPPWD		(1 << 29)
/** ADC2_CR_ADVREGEN ADC voltage regulator enable **/
#define ADC2_CR_ADVREGEN		(1 << 28)
/** ADC2_CR_LINCALRDYW6 Linearity calibration ready Word 6 **/
#define ADC2_CR_LINCALRDYW6		(1 << 27)
/** ADC2_CR_LINCALRDYW5 Linearity calibration ready Word 5 **/
#define ADC2_CR_LINCALRDYW5		(1 << 26)
/** ADC2_CR_LINCALRDYW4 Linearity calibration ready Word 4 **/
#define ADC2_CR_LINCALRDYW4		(1 << 25)
/** ADC2_CR_LINCALRDYW3 Linearity calibration ready Word 3 **/
#define ADC2_CR_LINCALRDYW3		(1 << 24)
/** ADC2_CR_LINCALRDYW2 Linearity calibration ready Word 2 **/
#define ADC2_CR_LINCALRDYW2		(1 << 23)
/** ADC2_CR_LINCALRDYW1 Linearity calibration ready Word 1 **/
#define ADC2_CR_LINCALRDYW1		(1 << 22)
/** ADC2_CR_ADCALLIN Linearity calibration **/
#define ADC2_CR_ADCALLIN		(1 << 16)
/** ADC2_CR_BOOST Boost mode control **/
#define ADC2_CR_BOOST		(1 << 8)
/** ADC2_CR_JADSTP ADC group injected conversion stop **/
#define ADC2_CR_JADSTP		(1 << 5)
/** ADC2_CR_ADSTP ADC group regular conversion stop **/
#define ADC2_CR_ADSTP		(1 << 4)
/** ADC2_CR_JADSTART ADC group injected conversion start **/
#define ADC2_CR_JADSTART		(1 << 3)
/** ADC2_CR_ADSTART ADC group regular conversion start **/
#define ADC2_CR_ADSTART		(1 << 2)
/** ADC2_CR_ADDIS ADC disable **/
#define ADC2_CR_ADDIS		(1 << 1)
/** ADC2_CR_ADEN ADC enable **/
#define ADC2_CR_ADEN		(1 << 0)

/**@}*/

/** @defgroup adc2_ccr CCR ADC common control register
@{*/

/** ADC2_CCR_VBATEN VBAT enable **/
#define ADC2_CCR_VBATEN		(1 << 24)
/** ADC2_CCR_TSEN Temperature sensor enable **/
#define ADC2_CCR_TSEN		(1 << 23)
/** ADC2_CCR_VREFEN VREFINT enable **/
#define ADC2_CCR_VREFEN		(1 << 22)

#define ADC2_CCR_PRESC_SHIFT		18
#define ADC2_CCR_PRESC_MASK		0x0f
/** @defgroup adc2_ccr_presc PRESC ADC prescaler
@{*/
/**@}*/


#define ADC2_CCR_CKMODE_SHIFT		16
#define ADC2_CCR_CKMODE_MASK		0x03
/** @defgroup adc2_ccr_ckmode CKMODE ADC clock mode
@{*/
/**@}*/


/**@}*/

/** @defgroup adc2_cfgr CFGR ADC configuration register 1
@{*/

/** ADC2_CFGR_JQDIS ADC group injected contexts queue disable **/
#define ADC2_CFGR_JQDIS		(1 << 31)

#define ADC2_CFGR_AWDCH1CH_SHIFT		26
#define ADC2_CFGR_AWDCH1CH_MASK		0x1f
/** @defgroup adc2_cfgr_awdch1ch AWDCH1CH ADC analog watchdog 1 monitored channel selection
@{*/
/**@}*/

/** ADC2_CFGR_JAUTO ADC group injected automatic trigger mode **/
#define ADC2_CFGR_JAUTO		(1 << 25)
/** ADC2_CFGR_JAWD1EN ADC analog watchdog 1 enable on scope ADC group injected **/
#define ADC2_CFGR_JAWD1EN		(1 << 24)
/** ADC2_CFGR_AWD1EN ADC analog watchdog 1 enable on scope ADC group regular **/
#define ADC2_CFGR_AWD1EN		(1 << 23)
/** ADC2_CFGR_AWD1SGL ADC analog watchdog 1 monitoring a single channel or all channels **/
#define ADC2_CFGR_AWD1SGL		(1 << 22)
/** ADC2_CFGR_JQM ADC group injected contexts queue mode **/
#define ADC2_CFGR_JQM		(1 << 21)
/** ADC2_CFGR_JDISCEN ADC group injected sequencer discontinuous mode **/
#define ADC2_CFGR_JDISCEN		(1 << 20)

#define ADC2_CFGR_DISCNUM_SHIFT		17
#define ADC2_CFGR_DISCNUM_MASK		0x07
/** @defgroup adc2_cfgr_discnum DISCNUM ADC group regular sequencer discontinuous number of ranks
@{*/
/**@}*/

