grevaillot/svd_tools/headers/STM32H750x/adc2.h
/** @defgroup adc2_jdr4 JDR4 ADC group injected sequencer rank 4 register
@{*/


#define ADC2_JDR4_JDATA4_SHIFT		0
#define ADC2_JDR4_JDATA4_MASK		0xffffffff
/** @defgroup adc2_jdr4_jdata4 JDATA4 ADC group injected sequencer rank 4 conversion data
@{*/
/**@}*/


/**@}*/

/** @defgroup adc2_awd2cr AWD2CR ADC analog watchdog 2 configuration register
@{*/


#define ADC2_AWD2CR_AWD2CH_SHIFT		0
#define ADC2_AWD2CR_AWD2CH_MASK		0xfffff
/** @defgroup adc2_awd2cr_awd2ch AWD2CH ADC analog watchdog 2 monitored channel selection
@{*/
/**@}*/


/**@}*/

/** @defgroup adc2_awd3cr AWD3CR ADC analog watchdog 3 configuration register
@{*/


#define ADC2_AWD3CR_AWD3CH_SHIFT		1
#define ADC2_AWD3CR_AWD3CH_MASK		0xfffff
/** @defgroup adc2_awd3cr_awd3ch AWD3CH ADC analog watchdog 3 monitored channel selection
@{*/
/**@}*/


/**@}*/

/** @defgroup adc2_ltr2 LTR2 ADC watchdog lower threshold register 2
@{*/


#define ADC2_LTR2_LTR2_SHIFT		0
#define ADC2_LTR2_LTR2_MASK		0x3ffffff
/** @defgroup adc2_ltr2_ltr2 LTR2 Analog watchdog 2 lower threshold
@{*/
/**@}*/


/**@}*/

/** @defgroup adc2_htr2 HTR2 ADC watchdog higher threshold register 2
@{*/


#define ADC2_HTR2_HTR2_SHIFT		0
#define ADC2_HTR2_HTR2_MASK		0x3ffffff
/** @defgroup adc2_htr2_htr2 HTR2 Analog watchdog 2 higher threshold
@{*/
/**@}*/


/**@}*/

/** @defgroup adc2_ltr3 LTR3 ADC watchdog lower threshold register 3
@{*/


#define ADC2_LTR3_LTR3_SHIFT		0
#define ADC2_LTR3_LTR3_MASK		0x3ffffff
/** @defgroup adc2_ltr3_ltr3 LTR3 Analog watchdog 3 lower threshold
@{*/
/**@}*/


/**@}*/

/** @defgroup adc2_htr3 HTR3 ADC watchdog higher threshold register 3
@{*/


#define ADC2_HTR3_HTR3_SHIFT		0
#define ADC2_HTR3_HTR3_MASK		0x3ffffff
/** @defgroup adc2_htr3_htr3 HTR3 Analog watchdog 3 higher threshold
@{*/
/**@}*/


/**@}*/

/** @defgroup adc2_difsel DIFSEL ADC channel differential or single-ended mode selection register
@{*/


#define ADC2_DIFSEL_DIFSEL_SHIFT		0
#define ADC2_DIFSEL_DIFSEL_MASK		0xfffff
/** @defgroup adc2_difsel_difsel DIFSEL ADC channel differential or single-ended mode for channel
@{*/
/**@}*/


/**@}*/

/** @defgroup adc2_calfact CALFACT ADC calibration factors register
@{*/


#define ADC2_CALFACT_CALFACT_D_SHIFT		16
#define ADC2_CALFACT_CALFACT_D_MASK		0x7ff
/** @defgroup adc2_calfact_calfact_d CALFACTD ADC calibration factor in differential mode
@{*/
/**@}*/


#define ADC2_CALFACT_CALFACT_S_SHIFT		0
#define ADC2_CALFACT_CALFACT_S_MASK		0x7ff
/** @defgroup adc2_calfact_calfact_s CALFACTS ADC calibration factor in single-ended mode
@{*/
/**@}*/


/**@}*/

/** @defgroup adc2_calfact2 CALFACT2 ADC Calibration Factor register 2
@{*/


#define ADC2_CALFACT2_LINCALFACT_SHIFT		0
#define ADC2_CALFACT2_LINCALFACT_MASK		0x3fffffff
/** @defgroup adc2_calfact2_lincalfact LINCALFACT Linearity Calibration Factor
@{*/
/**@}*/


/**@}*/
